[
  {
    "icon": "🛠️",
    "title": "Department of Social Welfare and Development IV-A - Computer Programmer III (Fullstack Developer)",
    "date": "Sept 2025 - Present",
    "description": [
      "In charge of development of IPPMIS System Web Application of FO Based",
      "Maintain and enhance existing website applications to improve functionality and user experience.",
      "Developed Scalable Codebase and Modular Architecture.",
      "Utilized React JS, React Native, Typescript, MySQL and Crystal Reports.",
      "Utilized Git for project collaboration and version control.",
      "Collaborated with QA and PMs in Agile sprints, ensuring feature quality through daily meetings."
    ],
    "image": "/images/exp/DSWD.png"
  },
  {
    "icon": "🛠️",
    "title": "PETNET Inc. - Backend Developer",
    "date": "Feb 2025 - Sept 2025",
    "description": [
      "Developed and maintained RESTful APIs to support various web and mobile applications.",
      "Collaborated with both local and international clients, including Ukraine, to deliver high-quality software solutions.",
      "Built scalable, responsive web apps for performance and user satisfaction.",
      "Developed RESTful APIs to ensure scalability and efficient communication between services.",
      "Documented API specifications and usage guidelines, facilitating easier onboarding for new team members and external developers.",
      "Designed ERDs and optimized databases for performance and scalability.",
      "Expertise in multiple programming languages and frameworks including PHP, Typescript, JavaScript, and framework such as React, Next, Vue, Nuxt, Laravel, NodeJS."
    ],
    "image": "/images/exp/PETNET.png"
  },
  {
    "icon": "🛠️",
    "title": "Datalogic Systems Corp - Fullstack Developer ",
    "date": "Apr 2023 - Feb 2025",
    "description": [
      "Maintained and implemented using .NET framework and C# language  for updates in the existing Point of Sale System and optimized its performance",
      "Developed a web-based Kitchen Display System using Laravel and VueJS for restaurants to streamline order management.",
      "Developed and maintained order taking system for restaurants to improve order accuracy and efficiency.",
      "Developed RESTful Api's using Laravel and Code igniter for  different frontend applications.",
      "Collaborated with other developers using Git, GitHub and Gitlab, actively following the guidance of our seniors and the manager.",
      "Deployed Laravel and Code Igniter RESTful API's with Internet Information Services and Laragon server to production environments."
    ],
    "image": "/images/exp/DSC.png"
  }
]
